<?php

use Illuminate\Database\Seeder;

class AutorsTableSeeder extends Seeder
{
    public $last_name = ['Иванов','Смирнов','Кузнецов','Попов','Васильев','Петров','Соколов','Михайлов','Новиков','Федоров','Морозов','Волков','Алексеев','Лебедев','Семенов','Егоров','Павлов','Козлов','Степанов','Николаев','Орлов','Андреев','Макаров','Никитин','Захаров','Зайцев','Соловьев','Борисов','Яковлев','Григорьев','Романов','Воробьев','Сергеев','Кузьмин','Фролов','Александров','Дмитриев','Королев','Гусев','Киселев','Ильин','Максимов','Поляков','Сорокин','Виноградов','Ковалев','Белов','Медведев','Антонов','Тарасов'];
    public $first_name = ['Александр', 'Дмитрий', 'Максим', 'Сергей', 'Андрей', 'Алексей', 'Артём', 'Илья', 'Кирилл', 'Михаил', 'Никита', 'Матвей', 'Роман', 'Егор', 'Арсений', 'Иван', 'Денис', 'Евгений', 'Даниил', 'Тимофей', 'Владислав', 'Игорь', 'Владимир', 'Павел', 'Руслан'];

    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        for($i=1;$i < 30; $i++){
            DB::table('autors')->insert([
                'f_name' => $this->first_name[ rand(1, count($this->first_name)-1) ],
                'l_name' => $this->last_name[ rand(1, count($this->last_name)-1) ],
                'created_at' => date("Y-m-d H:i:s"),
            ]);
        }
    }
}
